
#Область ПрограммныйИнтерфейс

// Дополнить форму.
// Из ОбщегоМодуля.ПодключаемыеКоманды
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить команды.	
Процедура ДополнитьФорму(Форма) Экспорт 

	ИмяФормы = Форма.ИмяФормы ;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьЭлементыЗаказаПокупателяНаФорму(Форма);		
	ИначеЕсли  ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
        ВставитьПолеКонтактноеЛицоПослеКонтрагента(Форма);
	ИначеЕсли  ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
        ВставитьПолеКонтактноеЛицоПослеКонтрагента(Форма);
	ИначеЕсли  ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
        ВставитьПолеКонтактноеЛицоПослеГруппаШапкаПраво(Форма);
	ИначеЕсли  ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоПослеГруппаШапкаПраво(Форма);    
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ВставитьЭлементыЗаказаПокупателяНаФорму(Форма)

    РеквизитФормыКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво); 
	РеквизитФормыКонтактноеЛицо.Вид 		= ВидПоляФормы.ПолеВвода;
	РеквизитФормыКонтактноеЛицо.ПутьКДанным = "Объект.Д_КонтактноеЛицо";   
	
	ГруппаСкидки = Форма.Элементы.Добавить("ГруппаСкидки",Тип("ГруппаФормы"),) ;	
	ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа ;  
	ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Форма.Элементы.Переместить(ГруппаСкидки, Форма.Элементы.ГруппаШапкаПраво) ; 	
	
	РеквизитФормыСогласованнаяСкидка = Форма.Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы"),ГруппаСкидки); 
	РеквизитФормыСогласованнаяСкидка.Вид 		 = ВидПоляФормы.ПолеВвода;
	РеквизитФормыСогласованнаяСкидка.ПутьКДанным = "Объект.Д_СогласованнаяСкидка";
	РеквизитФормыСогласованнаяСкидка.УстановитьДействие("ПриИзменении","ПриИзмененииСогласованнойСкидки");
		
	КомандаПересчитатьСкидку = Форма.Команды.Добавить("ПересчитатьСкидку");
	КомандаПересчитатьСкидку.Заголовок = "Пересчитать скидку";
	КомандаПересчитатьСкидку.Действие  = "КомандаПересчитатьСкидку" ;
	
	НоваяКоманда = Форма.Элементы.Добавить("КнопкаПересчитатьСкидку", Тип("КнопкаФормы"), ГруппаСкидки);
	НоваяКоманда.ИмяКоманды = "ПересчитатьСкидку" ; 


КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоПослеКонтрагента(Форма)

	РеквизитФормыКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы")); 
	РеквизитФормыКонтактноеЛицо.Вид 		= ВидПоляФормы.ПолеВвода;
	РеквизитФормыКонтактноеЛицо.ПутьКДанным = "Объект.Д_КонтактноеЛицо"; 
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоПослеГруппаШапкаПраво(Форма)
	
	РеквизитФормыКонтактноеЛицо = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво); 
	РеквизитФормыКонтактноеЛицо.Вид 		= ВидПоляФормы.ПолеВвода;
	РеквизитФормыКонтактноеЛицо.ПутьКДанным = "Объект.Д_КонтактноеЛицо"; 
	
КонецПроцедуры  

#КонецОбласти

