
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//Комиссаров 23.11.2025 ++ Суммирование скидки в шапке со скидкой в тч
	СуммаСкидок = Объект.Д_СогласованнаяСкидка + ТекущиеДанные.Скидка  ;
	Если СуммаСкидок < 100 Тогда
		Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество ;
		ТекущиеДанные.Сумма = Сумма - (Сумма * (СуммаСкидок / 100));
	Иначе
		ТекущиеДанные.Сумма = 0 ;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле 	= ТекущиеДанные.Номенклатура ;
		Сообщение.Текст = СтрШаблон("Сумма скидки по Номенклатуре %1 больше или равна 100",ТекущиеДанные.Номенклатура);
		Сообщение.Сообщить();
	КонецЕсли; 
	//Комиссаров 23.11.2025 --

	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьСкидку(Команда)
 	//Комиссаров 13.11.2025 ++ homework-11-2 Команда Пересчета Суммы в табличной части
    ПересчетСкидкиТабличныхЧастей();	
	//Комиссаров 13.11.2025 --
КонецПроцедуры

 &НаКлиенте
Процедура ПересчетСкидкиТабличныхЧастей()
 	//Комиссаров 13.11.2025 ++ homework-11-2 Команда Пересчета Суммы в табличной части
	Для Каждого Товар Из Объект.Товары Цикл
		РассчитатьСуммуСтроки(Товар);		
	КонецЦикла;  
	
	Для Каждого Услуга Из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(Услуга);
	КонецЦикла;
	//Комиссаров 13.11.2025 --
КонецПроцедуры

 &НаКлиенте
Процедура ПриИзмененииСогласованнойСкидки()
	ЗадатьВопросАсинх() ;
КонецПроцедуры
		
&НаКлиенте
АСИНХ Процедура ЗадатьВопросАсинх()
 	//Комиссаров 13.11.2025 ++ homework-11-2  Пересчет Суммы в табличной части при изменении скидки   
	Если (ЗначениеЗаполнено(Объект.Товары) ИЛИ ЗначениеЗаполнено(Объект.Услуги))= ЛОЖЬ ТОГДА
		Возврат;
	КонецЕсли;
	
	Обещание = ВопросАсинх("Изменен процент скидки. Пересчитать таблицу товаров и услуг?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Результат = Ждать Обещание; 
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		ПересчетСкидкиТабличныхЧастей();
	КонецЕсли;
	//Комиссаров 13.11.2025 --	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
